doc/artilleryConConsole.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 84
    },
    "firstCounterAt": 1671306396808,
    "firstHistogramAt": 1671306396890,
    "lastCounterAt": 1671306408675,
    "lastHistogramAt": 1671306408675,
    "firstMetricAt": 1671306396808,
    "lastMetricAt": 1671306408675,
    "period": 1671306400000,
    "summaries": {
      "http.response_time": {
        "min": 26,
        "max": 1183,
        "count": 1000,
        "p50": 507.8,
        "median": 507.8,
        "p75": 645.6,
        "p90": 804.5,
        "p95": 944,
        "p99": 1085.9,
        "p999": 1176.4
      },
      "vusers.session_length": {
        "min": 9224.7,
        "max": 11113.1,
        "count": 50,
        "p50": 11050.8,
        "median": 11050.8,
        "p75": 11050.8,
        "p90": 11050.8,
        "p95": 11050.8,
        "p99": 11050.8,
        "p999": 11050.8
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 26,
        "max": 1183,
        "count": 1000,
        "p50": 507.8,
        "median": 507.8,
        "p75": 645.6,
        "p90": 804.5,
        "p95": 944,
        "p99": 1085.9,
        "p999": 1176.4
      },
      "vusers.session_length": {
        "min": 9224.7,
        "max": 11113.1,
        "count": 50,
        "p50": 11050.8,
        "median": 11050.8,
        "p75": 11050.8,
        "p90": 11050.8,
        "p95": 11050.8,
        "p99": 11050.8,
        "p999": 11050.8
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 248,
        "http.codes.200": 198,
        "http.responses": 198
      },
      "rates": {
        "http.request_rate": 79
      },
      "http.request_rate": null,
      "firstCounterAt": 1671306396808,
      "firstHistogramAt": 1671306396890,
      "lastCounterAt": 1671306399979,
      "lastHistogramAt": 1671306399978,
      "firstMetricAt": 1671306396808,
      "lastMetricAt": 1671306399979,
      "period": "1671306390000",
      "summaries": {
        "http.response_time": {
          "min": 26,
          "max": 1048,
          "count": 198,
          "p50": 528.6,
          "median": 528.6,
          "p75": 788.5,
          "p90": 925.4,
          "p95": 1022.7,
          "p99": 1043.3,
          "p999": 1043.3
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 26,
          "max": 1048,
          "count": 198,
          "p50": 528.6,
          "median": 528.6,
          "p75": 788.5,
          "p90": 925.4,
          "p95": 1022.7,
          "p99": 1043.3,
          "p999": 1043.3
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 802,
        "http.responses": 802,
        "http.requests": 752,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 89
      },
      "http.request_rate": null,
      "firstCounterAt": 1671306400021,
      "firstHistogramAt": 1671306400021,
      "lastCounterAt": 1671306408675,
      "lastHistogramAt": 1671306408675,
      "firstMetricAt": 1671306400021,
      "lastMetricAt": 1671306408675,
      "period": "1671306400000",
      "summaries": {
        "http.response_time": {
          "min": 162,
          "max": 1183,
          "count": 802,
          "p50": 507.8,
          "median": 507.8,
          "p75": 596,
          "p90": 757.6,
          "p95": 820.7,
          "p99": 1085.9,
          "p999": 1176.4
        },
        "vusers.session_length": {
          "min": 9224.7,
          "max": 11113.1,
          "count": 50,
          "p50": 11050.8,
          "median": 11050.8,
          "p75": 11050.8,
          "p90": 11050.8,
          "p95": 11050.8,
          "p99": 11050.8,
          "p999": 11050.8
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 162,
          "max": 1183,
          "count": 802,
          "p50": 507.8,
          "median": 507.8,
          "p75": 596,
          "p90": 757.6,
          "p95": 820.7,
          "p99": 1085.9,
          "p999": 1176.4
        },
        "vusers.session_length": {
          "min": 9224.7,
          "max": 11113.1,
          "count": 50,
          "p50": 11050.8,
          "median": 11050.8,
          "p75": 11050.8,
          "p90": 11050.8,
          "p95": 11050.8,
          "p99": 11050.8,
          "p999": 11050.8
        }
      }
    }
  ]
}